[
  {
    "title": "A Comprehensive Guide to Incorporating a Limited Liability Partnership (LLP) in India",
    "date": "2025-09-22",
    "content": "Incorporating a Limited Liability Partnership (LLP) in India is a streamlined process governed by the Limited Liability Partnership Act, 2008, and managed by the Ministry of Corporate Affairs (MCA). An LLP offers the flexibility of a partnership with the limited liability protection of a company, requiring at least two partners (one resident in India). The process takes about 15 working days with no minimum capital requirement. Below is a detailed guide covering the process, requirements, references, and additional notes.\n\n### Process for Incorporating an LLP\n\n**Step 1: Obtain Digital Signature Certificate** (DSC)\n- Apply through any MCA-authorized certifying authority.\n- Submit PAN card, Aadhaar, photo, and address proof for each designated partner.\n\n**Step 2: Obtain Director Identification Number** (DIN)\n- Apply for DIN for up to two designated partners directly via Form FiLLiP.\n- If applying separately, use Form DIR-3 with identity and address proofs.\n- Ensure at least one partner is an Indian resident.\n\n**Step 3: Reserve the LLP Name**\n- Propose up to two unique names ending with \"LLP\" or \"Limited Liability Partnership.\"\n- Check name availability on the MCA portal; avoid trademarks or restricted words.\n- File RUN-LLP form online; approval valid for 3 months with one resubmission allowed within 15 days.\n\n**Step 4: File Incorporation Form** (FiLLiP)\n- Submit Form FiLLiP online with DSC, including partner details, registered office, and contribution.\n- Attach proof of registered office (e.g., rent agreement, utility bill), consent letters, and subscriber sheets.\n\n**Step 5: Receive Certificate of Incorporation**\n- Upon FiLLiP approval, ROC issues the Certificate of Incorporation with an LLPIN enabling the LLP to commence business.\n\n**Step 6: Draft and File LLP Agreement**\n- Draft agreement outlining partners’ rights, duties, profit-sharing, and operations.\n- Sign on stamp paper (value varies by state); notarize if required.\n- File Form 3 within 30 days of incorporation.\n\n**Step 7: Obtain PAN and TAN**\n- PAN is auto-generated with incorporation.\n- Apply for TAN using Form 49B on the NSDL portal.\n- Submit Certificate of Incorporation and address proof.\n\n**Step 8: Open Bank Account and Commence Operations**\n- Open a current bank account with Certificate of Incorporation, PAN, TAN, and LLP Agreement.\n- Comply with annual filings (Form 8 for accounts, Form 11 for annual return).\n\n### Documents Required to Start LLP Incorporation\n- **PAN Card**: For each designated partner.\n- **Aadhaar Card**: For each designated partner.\n- **Photo**: Passport-sized photo for each designated partner.\n- **Address Proof**: For each designated partner (e.g., passport, voter ID, or driving license).\n- **Proof of Registered Office**: Rent agreement or utility bill for the LLP’s office address.\n- **Consent Letters**: From designated partners agreeing to act as partners.\n- **Subscriber Sheets**: Signed by partners, detailing their contribution to the LLP.\n\n### Links and References\n- **MCA Portal**: For DSC guidelines, DIN, name reservation, and incorporation forms. [Link](https://www.mca.gov.in/content/mca/global/en/home.html)\n- **NSDL Portal**: For PAN and TAN applications. [Link](https://tinpan.proteantech.in/)\n- **LLP Act, 2008**: Official Act, Amendments, Rules, Circulars and Notifications for LLP. [Link](https://www.mca.gov.in/content/mca/global/en/acts-rules/llp-act-2008.html/)\n\n### Notes\n- **Pre-Incorporation**: Ensure DSC and DIN are obtained for all designated partners; verify name availability to avoid rejection.\n- **During Incorporation**: File FiLLiP accurately within 3 months of name approval; ensure registered office proof is valid.\n- **Post-Incorporation**: File LLP Agreement (Form 3) within 30 days to avoid penalties; comply with annual filings (Form 8 by October 30, Form 11 by May 30).\n\nFor a seamless LLP incorporation process, **Jayadeva & Co.** provides expert guidance and support to ensure compliance and efficiency. [Contact us](https://www.jayadeva.in/contact.html)",
    "tags": ["LLP", "Registration"],
    "pinned": false
  }
]
